[
  {
    "key": 9788415913481,
    "valor": {
      "title": "LA GITANILLA",
      "date": "2019-09-16",
      "author": "Miguel de Cervantes Saavedra",
      "categoriesList": [
        "Literatura",
        "Clasicos"
      ],
      "publisher": "NIVOLA LIBROS Y EDICIONES",
      "description": "La protagonista principal de la narración es Preciosa, una gitanilla de quince años, hermosa e inteligente, que vive con su abuela. Pasea con sus compañeras y canta romances en las calles madrileñas a cambio de algunas monedas. Pronto es conocida en la ciudad por su belleza, gracia y buen juicio; ella siempre sabe responder con las palabras adecuadas y sorprende a todos por su sabiduría, tan impropia en alguien de su edad.",
      "language": "CASTELLANO",
      "pages": 144,
      "stock": 15,
      "available": 15
    }
  },
  {
    "key": 9781449370770,
    "valor": {
      "title": "Java 8 Lambdas",
      "date": "2014-05-06",
      "author": "Richard Warburton",
      "categoriesList": [
        "Educación",
        "Programación",
        "Java"
      ],
      "publisher": "O\u0027Reilly Media-1th edition",
      "description": "If you’re a developer with core Java SE skills, this hands-on book takes you through the language changes in Java 8 triggered by the addition of lambda expressions. You’ll learn through code examples, exercises, and fluid explanations how these anonymous functions will help you write simple, clean, library-level code that solves business problems.",
      "language": "INGLÉS",
      "pages": 180,
      "stock": 20,
      "available": 20
    }
  },
  {
    "key": 9788412295511,
    "valor": {
      "title": "LA LLAMADA DE CTHULHU",
      "date": "2021/06/21",
      "author": "H. P. Lovecraft",
      "categoriesList": [
        "Misterio",
        "Horror",
        "cosmico"
      ],
      "publisher": "Alpha Decay",
      "description": "En el invierno de 1926 fallece el tío abuelo del narrador de este cuento de culto, profesor de lenguas semíticas en la universidad de Brown y autoridad en el campo de las inscripciones antiguas. La medicina no puede aclarar las circunstancias de esta muerte envuelta por el misterio.",
      "language": "Castellano",
      "pages": 96,
      "stock": 10,
      "available": 10
    }
  },
  {
    "key": 9788441539907,
    "valor": {
      "title": "Arquitectura limpia: Guía para especialistas en la estructura y el diseño de software",
      "date": "2018-03-01",
      "author": "Robert C. Martin",
      "categoriesList": [
        "Educación",
        "Programación"
      ],
      "publisher": "ANAYA MULTIMEDIA",
      "description": "Aplicando unas reglas universales de la arquitectura de software, podrá mejorar tremendamente la productividad en la implementación de cualquier programa. ",
      "language": "CASTELLANO",
      "pages": 320,
      "stock": 12,
      "available": 12
    }
  },
  {
    "key": 9780596527754,
    "valor": {
      "title": "Java Generics and Collections",
      "date": "2006-11-21",
      "author": "Maurice Naftalin",
      "categoriesList": [
        "Educación",
        "Programación",
        "Java"
      ],
      "publisher": "O\u0027Reilly Media-1th edition",
      "description": "This comprehensive guide shows you how to master the most important changes to Java since it was first released. Generics and the greatly expanded collection libraries have tremendously increased the power of Java 5 and Java 6. But they have also confused many developers who haven\u0027t known how to take advantage of these new features.",
      "language": "INGLÉS",
      "pages": 273,
      "stock": 20,
      "available": 20
    }
  },
  {
    "key": 9782409030376,
    "valor": {
      "title": "SQL FUNDAMENTOS DEL LENGUAJE (CON EJERCICIOS CORREGIDOS) (3ª EDICIÓN)",
      "date": "2021/04/14",
      "author": "ANNE CHRISTINE BISSON ",
      "categoriesList": [
        "Educacion",
        "Computacion"
      ],
      "publisher": "ENI",
      "description": "Este libro sobre los fundamentos del lenguaje SQL se dirige a desarrolladores e informáticos principiantes que deban trabajar con un Sistema Gestor de Bases de Datos Relacionales (SGBDR) para almacenar y manipular datos. Su objetivo es describir los principales comandos más utilizados del lenguaje SQL (independientemente de las variaciones realizadas por los editores de los diferentes SGBDR) para permitir al lector hacerse cargo rápidamente de una base de datos relacional y ser capaz de crear tablas, de consultarlas, de modificarlas, de insertar y suprimir registros. ",
      "language": "CASTELLANO",
      "pages": 120,
      "stock": 13,
      "available": 13
    }
  },
  {
    "key": 9788415618775,
    "valor": {
      "title": "EL PERRO DE LOS BASKERVILLE",
      "date": "2021-11-24",
      "author": "Arthur Conan Doyle",
      "categoriesList": [
        "Literatura",
        "Novela",
        "negra",
        "Misterio",
        "Policial"
      ],
      "publisher": "ALMA EUROPA",
      "description": "Después de que sir Charles Baskerville aparezca muerto en extrañas circunstancias, su médico solicitará los servicios de Holmes. Aunque los habitantes del condado creen que el noble ha sido víctima del sabueso infernal que ha hostigado a su linaje generación tras generación, el detective tratará de no permitir que las supercherías enturbien su juicio analítico para desenmascarar al asesino de sir Baskerville.“No es cuestión de lo que sabemos, sino de lo que podemos demostrar.",
      "language": "CASTELLANO",
      "pages": 192,
      "stock": 20,
      "available": 20
    }
  },
  {
    "key": 9788418174193,
    "valor": {
      "title": "EL PRINCIPITO",
      "date": "2021-05-04",
      "author": "Antoine de Saint Exupery",
      "categoriesList": [
        "Literatura",
        "Infantil"
      ],
      "publisher": "SALAMANDRA",
      "description": "Fábula mítica y relato filosófico que interroga acerca de la relación del ser humano con su prójimo y con el mundo, El Principito  concentra, con maravillosa simplicidad, la constante reflexión de  Saint-Exupery sobre la amistad, el amor y el sentido de la vida.",
      "language": "CASTELLANO",
      "pages": 96,
      "stock": 5,
      "available": 5
    }
  },
  {
    "key": 9788466236645,
    "valor": {
      "title": "DON QUIJOTE DE LA MANCHA",
      "date": "2016-11-04",
      "author": "Miguel de Cervantes Saavedra",
      "categoriesList": [
        "Literatura",
        "Clasicos"
      ],
      "publisher": "LIBSA",
      "description": "Aquí descubriremos al loco más lúcido de la historia de la literatura, tanto que recorriendo un lugar de la mancha, inventó su propia realidad para huir del mundo que le rodeaba.",
      "language": "CASTELLANO",
      "pages": 640,
      "stock": 15,
      "available": 15
    }
  },
  {
    "key": 9798800165043,
    "valor": {
      "title": "Clean JavaScript",
      "date": "2022-04-10",
      "author": "Miguel A. Gómez",
      "categoriesList": [
        "Educación",
        "Programación",
        "JavaScript"
      ],
      "publisher": "Independently published",
      "description": "JavaScript se ha convertido en uno de los lenguajes más utilizados del mundo, se encuentra en infraestructuras críticas de empresas muy importantes (Facebook, Netflix o Uber lo utilizan). Por esta razón, se ha vuelto indispensable la necesidad de escribir código de mayor calidad y legibilidad.",
      "language": "CASTELLANO",
      "pages": 169,
      "stock": 20,
      "available": 20
    }
  },
  {
    "key": 1,
    "valor": {
      "title": "Un libro",
      "date": "2006-11-21",
      "author": "Maurice Naftalin",
      "categoriesList": [
        "Educación",
        "Programación",
        "Java"
      ],
      "publisher": "O\u0027Reilly Media-1th edition",
      "description": "This comprehensive guide shows you how to master the most important changes to Java since it was first released. Generics and the greatly expanded collection libraries have tremendously increased the power of Java 5 and Java 6. But they have also confused many developers who haven\u0027t known how to take advantage of these new features.",
      "language": "INGLÉS",
      "pages": 273,
      "stock": 20,
      "available": 20
    }
  },
  {
    "key": 9781324001805,
    "valor": {
      "title": "The Iliad",
      "date": "2023-08-26",
      "author": "Homer",
      "categoriesList": [
        "Literatura",
        "Ficción",
        "Clasicos"
      ],
      "publisher": "W. W. Norton \u0026 Company",
      "description": "The Iliad roars with the clamor of arms, the bellowing boasts of victors, the fury and grief of loss, and the anguished cries of dying men. It sings, too, of the sublime magnitude of the world―the fierce beauty of nature and the gods’ grand schemes beyond the ken of mortals. In Wilson’s hands, this thrilling, magical, and often horrifying tale now gallops at a pace befitting its legendary battle scenes, in crisp but resonant language that evokes the poem’s deep pathos and reveals palpably real, even “complicated,” characters―both human and divine.",
      "language": "INGLÉS",
      "pages": 848,
      "stock": 12,
      "available": 12
    }
  },
  {
    "key": 9781607102113,
    "valor": {
      "title": "THE ADVENTURES OF SHERLOCK HOLMES AND OTHER STORIES",
      "date": "2021-11-24",
      "author": "Arthur Conan Doyle",
      "categoriesList": [
        "Policial"
      ],
      "publisher": "CANTERBURY CLASSICS",
      "description": "There is one literary detective who stands above all others, whose powers of deduction are known the world over, whose influence can still be felt in today\u0027s most modern whodunits. Who is it, you ask? Why, it\u0027s elementary! Sherlock Holmes, the famous gumshoe of 221B Baker Street. And Sir Arthur Conan Doyle--the man who made him famous in such tales as The Hound of the Baskervilles and A Study in Scarlet--changed the world of mysteries, inspiring legions of devoted fans.",
      "language": "INGLÉS",
      "pages": 120,
      "stock": 20,
      "available": 20
    }
  },
  {
    "key": 9786123042370,
    "valor": {
      "title": "FUNDAMENTOS DE PROGRAMACION PHP",
      "date": "",
      "author": "RICARDO MARCELO VILLALOBOS",
      "categoriesList": [
        "Informatica",
        "Computacion"
      ],
      "publisher": "MACRO",
      "description": "",
      "language": "Español",
      "pages": 359,
      "stock": 10,
      "available": 10
    }
  },
  {
    "key": 9788413524894,
    "valor": {
      "title": "LAS BASES DE BIG DATA Y DE LA INTELIGENCIA ARTIFICIAL",
      "date": "2022/05/03 ",
      "author": "Enrique Martin",
      "categoriesList": [
        "Informatica",
        "ingenieria"
      ],
      "publisher": "LA CATARATA",
      "description": "Cada clic en Internet es un dato que, bien aprovechado, puede servir, por ejemplo, para adecuar las páginas a nuestras preferencias, pero tambien para ofrecer publicidad personalizada. Los telefonos móviles emiten constantemente datos sobre nuestra ubicación o el uso de aplicaciones.",
      "language": "CASTELLANO",
      "pages": 128,
      "stock": 12,
      "available": 12
    }
  },
  {
    "key": 9788415618874,
    "valor": {
      "title": "ESTUDIO EN ESCARLATA. EL SIGNO DE LOS CUATRO",
      "date": "2018-06-22",
      "author": "Arthur Conan Doyle",
      "categoriesList": [
        "Literatura",
        "Novela",
        "negra",
        "Misterio",
        "Policial"
      ],
      "publisher": "ALMA EUROPA ",
      "description": "El cadáver de Enoch Drebber, hallado en extrañas circunstancias en una casa deshabitada, provoca que los agentes de Scotland Yard investiguen en la dirección equivocada. Un nuevo asesinato lo complica todo aún más. Para resolver el misterio, Holmes y Watson deberán remontarse en el tiempo a otros asesinatos ocurridos 30 años atrás en la ciudad mormona de Salt Lake City.",
      "language": "CASTELLANO",
      "pages": 288,
      "stock": 15,
      "available": 15
    }
  },
  {
    "key": 9788418037542,
    "valor": {
      "title": "TRILOGIA FUNDACION",
      "date": "2022-04-07",
      "author": "Isaac Asimov",
      "categoriesList": [
        "Literaruta",
        "Ciencia-Ficcion"
      ],
      "publisher": "NOVA",
      "description": "Isaac Asimov empezó a escribir la saga de la Fundación a los veintiún  años, sin saber que un día esta obra se convertiría en la piedra angular  de la ciencia ficción del siglo XX, ni que con ella cautivaría a lectores de todas las edades durante más de siete decadas.",
      "language": "CASTELLANO",
      "pages": 832,
      "stock": 16,
      "available": 16
    }
  },
  {
    "key": 9788426732279,
    "valor": {
      "title": "PYTHON A FONDO",
      "date": "2021/02/08",
      "author": "OSCAR RAMIREZ JIMENEZ",
      "categoriesList": [
        "ciencia",
        "informatica"
      ],
      "publisher": "MARCOMBO",
      "description": "Python es el mejor lenguaje de programación tanto para novatos como para veteranos. Es usado en empresas y start-ups de primer nivel, y cada día es más demandado y reconocido mundialmente.  Gracias a su carácter polivalente, Python se emplea en las FANG (Facebook, Amazon, Netflix y Google), en scripts simples, aplicaciones de domótica, programación de aplicaciones de escritorio o aplicaciones web complejas que soportan miles de usuarios por segundo, como Instagram o YouTube.",
      "language": "Español",
      "pages": 648,
      "stock": 13,
      "available": 13
    }
  },
  {
    "key": 9788435018364,
    "valor": {
      "title": "YO, ROBOT",
      "date": "2009-06-01",
      "author": "Isaac Asimov",
      "categoriesList": [
        "Literatura",
        "Ciencia-Ficcion"
      ],
      "publisher": "EDHASA",
      "description": "Aquí formuló Issac Asomov por primera vez las tres leyes fundamentales de la robótica, de las que se valdría para plantear interrogantes que se adentran en el campo de la ética y de la psicología: ¿ qué diferencia hay entre un robot inteligente y un ser humano?, ¿puede el creador de un robot predecir su comportamiento? , ¿ debe la lógica determinar lo que es mejor para la humanidad? A través de una serie de historias conectadas entre sí por el personaje de la robopsicóloga Susan Calvin, en las que aparecen todo tipo de máquinas inteligentes",
      "language": "CASTELLANO",
      "pages": 328,
      "stock": 15,
      "available": 15
    }
  },
  {
    "key": 9788445006757,
    "valor": {
      "title": "¿SUEÑAN LOS ANDROIDES CON OVEJAS ELECTRICAS?",
      "date": "2019-10-22",
      "author": "Philip K. Dick",
      "categoriesList": [
        "Literatura",
        "Ciencia-Ficcion"
      ],
      "publisher": "MINOTAURO",
      "description": "Las empresas fabrican incluso seres humanos. Rick Deckard es un cazarrecompensas cuyo trabajo es encontrar androides rebeldes y retirarlos, pero la tarea no será tan sencilla cuando tenga que enfrentarse a los nuevos modelos Nexus-6, prácticamente indistinguibles de los seres humanos.",
      "language": "CASTELLANO",
      "pages": 288,
      "stock": 10,
      "available": 10
    }
  },
  {
    "key": 9789876298995,
    "valor": {
      "title": "BIG DATA BREVE MANUAL PARA CONOCER LA CIENCIA DE DATOS QUE YA INVADIÓ NUESTRAS VIDAS",
      "date": "2019/07/01",
      "author": "Walter Sosa Escudero",
      "categoriesList": [
        "Computacion",
        "Informatica"
      ],
      "publisher": "SIGLO XXI ARGENTINA ",
      "description": "Cada vez que deslizamos nuestros dedos por una pantalla e ingresamos a una página web para hacer una compra o buscar una dirección, cada vez que hacemos un posteo, damos un like o subimos una foto a las redes sociales, cada vez que usamos la tarjeta de crédito, el GPS, cada vez que… estamos generando datos, ¡cantidades espeluznantes de datos espontáneos! (de hecho, en los últimos dos años la humanidad produjo más datos que en toda su historia previa). ¿Adónde van parar? ¿Quién los analiza, los procesa, los usa y para qué? ¿Acaso nos espían? ¿Cómo afectan nuestra vida?",
      "language": "CASTELLANO",
      "pages": 208,
      "stock": 13,
      "available": 13
    }
  },
  {
    "key": 9999999999999,
    "valor": {
      "title": "EL ultimo",
      "date": "2006-11-21",
      "author": "Maurice Naftalin",
      "categoriesList": [
        "Educación",
        "Programación",
        "Java"
      ],
      "publisher": "O\u0027Reilly Media-1th edition",
      "description": "This comprehensive guide shows you how to master the most important changes to Java since it was first released. Generics and the greatly expanded collection libraries have tremendously increased the power of Java 5 and Java 6. But they have also confused many developers who haven\u0027t known how to take advantage of these new features.",
      "language": "INGLÉS",
      "pages": 273,
      "stock": 20,
      "available": 20
    }
  }
]